---
kind: other
id: Properties.T:Autodesk.Revit.UI.ExternalEvent
source: html/02965a0f-dcb5-6dd0-62e2-848a4dd8627e.htm
---
# ExternalEvent Properties

Checking whether an event has been raised but not yet executed.